Repository: common-repository/ogoship-nettivarasto-api-for-woocommerce
Catalog: i18n/languages/ogoship-nettivarasto-api-for-woocommerce-*.po
Languages: fi

source: Transfer to OGOship
fi: Siirrä OGOshipiin

source: Transfer orders made by this shipping method automatically to OGOship.
fi: Siirrä tällä toimitustavalla tehdyt tilaukset automaattisesti OGOshipiin.

source: OGOship Delivery Type
fi: OGOshipin Toimitustapa

source: Set external code of the OGOship delivery type for this shipping method.
fi: Aseta OGOshipin toimitustavan koodi tälle toimitustavalle.

source: OGOship General Settings
fi: OGOship yleiset asetukset

source: The following are OGOship general settings.
fi: Alla olevat ovat OGOshipin yleisiä asetuksia.

source: Export
fi: Vie

source: Click here
fi: Klikkaa tästä

source: to export all products to Nettivarasto
fi: viedäksesi kaikki tuotteet Nettivarastoon

source: Update Orders and Products
fi: Tilausten ja Tuotetietojen Päivitys

source: to update product and order info from OGOship
fi: päivittääksesi tuotteiden varastosaldot ja tilausten tilat OGOshipista

source: Check duplicate and empty SKUs
fi: Tarkista päällekkäiset ja tyhjät SKUt

source: to view the duplicate and empty sku products
fi: katsoaksesi päällekkäiset ja tyhjät sku -tuotteet

source: never
fi: ei koskaan

source: Latest successful update from OGOship
fi: Viimeisin onnistunut päivitys OGOshipista

source: Merchant ID
fi: Kauppias ID

source: Insert Merchant ID from OGOship
fi: Syötä myOGOsta saamasi kauppias ID

source: Secret Token
fi: Salainen avain

source: Insert OGOship Secret token
fi: Syötä myOGOsta saamasi salainen avain

source: Deny product export
fi: Estä tuotteiden vienti

source: This option will deny the product export to OGOship
fi: Tämä valinta estää tuotetietojen viennin OGOshipiin

source: Hourly order status and product stock updates on/off
fi: Ajastettu tilausten tilojen ja tuotteiden saldon päivitys päälle/pois

source: Check to enable automatic hourly retrieval of latest order status and product stock level changes.
fi: Rastita ottaaksesi käyttöön ajastetun tilausten tilojen ja tuotesaldojen hakeminen.

source: Supplier:
fi: Toimittaja:

source: Enter name of supplier for OGOship.
fi: Syötä tavarantoimittajan nimi OGOshipissa.

source: Supplier code:
fi: Tavarantoimittajan koodi:

source: Enter code of supplier for OGOship.
fi: Tavarantoimittajan koodi OGOshipissa.

source: Group:
fi: Tuoteryhmä:

source: Enter group of product for OGOship.
fi: Syötä OGOship tuoteryhmä.

source: Purchase price:
fi: Sisäänostohinta:

source: Enter purchase price for OGOship.
fi: Syötä sisäänostohinta, joka lähetetään OGOshipiin.

source: Check if you do <strong>not</strong> want to export this product automatically to OGOship.
fi: Valitse, mikäli tämän tuotteen tietoja <strong>ei</strong> viedä OGOshipiin.

source: Do not export to OGOship
fi: Älä vie OGOshipiin

source: No products in order to export
fi: Tilauksessa ei tuotteita vietäväksi

source: Order transferred to OGOship
fi: Tilaus siirretty OGOshipiin

source: Error
fi: Virhe

source: Send order again.
fi: Lähetä tilaus uudestaan.

source: Product export denied in the OGOship settings.
fi: Tuotteiden vienti kielletty OGOship asetuksissa.

source: Product export completed.
fi: Tuotteiden vienti valmis.

source: Send Order to OGOship
fi: Lähetä tilaus OGOshipiin

source: Error loading order
fi: Virhe ladattaessa tilausta

source: from WooCommerce, skipping
fi: WooCommercesta, ohitetaan

source: OGOship change of status to SHIPPED.
fi: OGOship tila: SHIPPED.

source: Tracking code
fi: Seurantakoodi

source: OGOship change of status to CANCELLED.
fi: OGOship tila: CANCELLED.

source: OGOship change of status to COLLECTING.
fi: OGOship tila: COLLECTING.

source: OGOship change of status to PENDING.
fi: OGOship tila: PENDING.

source: OGOship change of status to RESERVED.
fi: OGOship tila: RESERVED.

source: OGOship change of status to DRAFT.
fi: OGOship tila: DRAFT.

source: Product and order data updated from OGOship.
fi: Tuotteiden ja tilausten tiedot päivitetty OGOshipista.

source: Track Your Shipment
fi: Seuraa lähetystäsi
